app/Controllers/News.php

        public function create()
        {
            helper('form');

            $data = $this->request->getPost(['title', 'body']);

            //Verifica se os dados enviadas passaram nas regras de validação
            if(! $this->validateData($data, [
                'title' => 'required|max_length[255]|min_length[3]',
                'body' => 'required|max_length[5000]|min_length[10]',
            ])) {
                //A validação falhou. Então volta ao formulario
                return  $this->new();
            }
            //Pega as validações das informações
            $post = $this->validator->getValidated();

            $model =model(NewsModel::class);

            $model->save([
                'title' => $post['title'],
                'slug' => url_title($post['title'], '-', true),
                'body' => $post['body'],
            ]);
---
INSERT INTO `News` (`title`, `slug`, `body`) VALUES ('Noticia nova2', 'noticia-nova2', 'teste testes')